navigator-soap/test-requests/test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://navigator.service.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:helloRequest>
        </gs:helloRequest>
    </soapenv:Body>
</soapenv:Envelope>